<h2>开发中</h2>
<pre>有没有脑子大的人来帮忙想想这个首页该做成什么样子？</pre>
<pre>开发说明先拿掉了，太难看。</pre>
<!--
<h2>开发说明</h2>
<pre>
1. header.php 和 footer.php 从Index文件夹中加载(参考IndexView.class.php 的代码)。

2. 每个人自己页面的元素，请在msc.css 文件中添加样式，并且一个人的代码写在一块内
   代码段前参照已有注释格式编写注释。

3. 不要修改项目中除application, css, js, images, fonts, sql 文件夹以外的程序。

4. 数据库统一使用msc作为用户，MSC作为数据库名。只需将msc.sql文件导入数据库即可。
   关于数据库用户的问题，翻看SDOJ群的聊天记录。

5. 前端代码请参照Index/文件夹内的代码，不要在header和footer文件中添加块元素。

更多其他问题，请谨慎操作。
</pre>

<h2>注意！</h2>
<pre>
1. 再重申一遍，不要更改动非自己代码段的代码。

2. Github的使用还不会上传的，想办法去学会。

3. 每天开始写之前先执行git pull，每次上传之前也要执行git pull

</pre>

<h2>一些技巧</h2>
<pre>

1. <F12>开启调试界面。最好将调试页拉出来单独做一个窗口。

2. 有任何问题在群里提出来并在Github上更新自己的代码，以方便解决问题的人可以在自己本地调试你的代码。

3. 有任何问题请先去看Husky的官方说明页，其次去看其他人在实现这一块的写法，最后再提问。
</pre>

<a href="http://www.baidu.com"><h2>给吴刚的外部链接问题的解答</h2></a>
<pre> 
标题是指向百度首页的链接。外部链接需要写http://www.baidu.com 这一完整形式，否则默认是本站内链接，直接提交给localhost处理了。
</pre>-->
